Ran Plan for dir: `infra` workspace: `default`

<details><summary>Show Output</summary>

```diff

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.26.0"...
- Installing hashicorp/aws v3.26.0...
- Installed hashicorp/aws v3.26.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.


Warning: Version constraints inside provider configuration blocks are deprecated

  on provider.tf line 2, in provider "aws":
   2:   version = "~> 3.26.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.s3-bucket will be created
  + resource "aws_s3_bucket" "s3-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "sample-123450-devops-aodtest"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warnings:

- Version constraints inside provider configuration blocks are deprecated
  on provider.tf line 2

To see the full warning notes, run Terraform without -compact-warnings.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "default.tfplan"
Detected Terraform directory at .
  [96;1m⠋[0m Running terraform plan   [96;1m⠙[0m Running terraform plan   [96;1m⠹[0m Running terraform plan   [96;1m⠸[0m Running terraform plan   [96;1m⠼[0m Running terraform plan   [96;1m⠴[0m Running terraform plan   [96;1m⠦[0m Running terraform plan   [96;1m⠧[0m Running terraform plan   [96;1m⠇[0m Running terraform plan   [96;1m⠏[0m Running terraform plan   [96;1m⠋[0m Running terraform plan   [96;1m⠙[0m Running terraform plan   [96;1m⠹[0m Running terraform plan   [96;1m⠸[0m Running terraform plan   [96;1m⠼[0m Running terraform plan   [96;1m⠴[0m Running terraform plan   [96;1m⠦[0m Running terraform plan   [96;1m⠧[0m Running terraform plan   [96;1m⠇[0m Running terraform plan   [96;1m⠏[0m Running terraform plan   [96;1m⠋[0m Running terraform plan   [96;1m⠙[0m Running terraform plan   [96;1m⠹[0m Running terraform plan   [96;1m⠸[0m Running terraform plan   [96;1m⠼[0m Running terraform plan   [96;1m⠴[0m Running terraform plan   [96;1m⠦[0m Running terraform plan   [96;1m⠧[0m Running terraform plan   [96;1m⠇[0m Running terraform plan   [96;1m⠏[0m Running terraform plan   [96;1m⠋[0m Running terraform plan   [96;1m⠙[0m Running terraform plan   [96;1m⠹[0m Running terraform plan   [96;1m⠸[0m Running terraform plan   [96;1m⠼[0m Running terraform plan   [96;1m⠴[0m Running terraform plan   [96;1m⠦[0m Running terraform plan   [96;1m⠧[0m Running terraform plan   [96;1m⠇[0m Running terraform plan   [96;1m⠏[0m Running terraform plan   [96;1m⠋[0m Running terraform plan   [96;1m⠙[0m Running terraform plan   [96;1m⠹[0m Running terraform plan   [96;1m⠸[0m Running terraform plan   [96;1m⠼[0m Running terraform plan   [96;1m⠴[0m Running terraform plan   [96m✔[0m Running terraform plan
  [96;1m⠋[0m Running terraform show   [96;1m⠙[0m Running terraform show   [96;1m⠹[0m Running terraform show   [96;1m⠸[0m Running terraform show   [96;1m⠼[0m Running terraform show   [96;1m⠴[0m Running terraform show   [96;1m⠦[0m Running terraform show   [96;1m⠧[0m Running terraform show   [96;1m⠇[0m Running terraform show   [96;1m⠏[0m Running terraform show   [96;1m⠋[0m Running terraform show   [96;1m⠙[0m Running terraform show   [96;1m⠹[0m Running terraform show   [96;1m⠸[0m Running terraform show   [96;1m⠼[0m Running terraform show   [96;1m⠴[0m Running terraform show   [96;1m⠦[0m Running terraform show   [96;1m⠧[0m Running terraform show   [96m✔[0m Running terraform show
  [96;1m⠋[0m Extracting only cost-related params from terraform   [96m✔[0m Extracting only cost-related params from terraform
  [96;1m⠋[0m Retrieving cloud prices to calculate costs   [96;1m⠙[0m Retrieving cloud prices to calculate costs   [96;1m⠹[0m Retrieving cloud prices to calculate costs   [96m✔[0m Retrieving cloud prices to calculate costs

[1mProject:[0m github.com/soansgla/sample-cicd-app.git/infra

 [4mName[0m                                             [4mMonthly Qty[0m  [4mUnit[0m                    [4mMonthly Cost[0m 
                                                                                                    
 [1maws_s3_bucket.s3-bucket[0m                                                                            
 [2m└─[0m Standard                                                                                        
 [2m   ├─[0m Storage                              Monthly cost depends on usage: $0.025 per GB            
 [2m   ├─[0m PUT, COPY, POST, LIST requests       Monthly cost depends on usage: $0.005 per 1k requests   
 [2m   ├─[0m GET, SELECT, and all other requests  Monthly cost depends on usage: $0.0004 per 1k requests  
 [2m   ├─[0m Select data scanned                  Monthly cost depends on usage: $0.0025 per GB           
 [2m   └─[0m Select data returned                 Monthly cost depends on usage: $0.0009 per GB           
                                                                                                    
[1m OVERALL TOTAL[0m                                                                                $0.00 
──────────────────────────────────
1 cloud resource was detected, rerun with --show-skipped to see details:
∙ 1 was estimated, 1 includes usage-based costs, see [4mhttps://infracost.io/usage-file[0m

[33mUpdate:[0m A new version of Infracost is available: [96mv0.9.19[0m → [96mv0.10.0[0m
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ip-10-0-8-66.ap-southeast-2.compute.internal:4141/lock?id=soansgla%252Fsample-cicd-app%252Finfra%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
